app/Http/Controllers/CartController.php

insert into `orders` (`user_id`, `total`, `updated_at`, `created_at`) values (1, 0, '2024-01-07 06:40:27', '2024-01-07 06:40:27')
insert into `items` (`quantity`, `price`, `product_id`, `order_id`, `updated_at`, `created_at`) values ('4', 25000, 1, 3, '2024-01-07 06:40:27', '2024-01-07 06:40:27')
update `users` set `balance` = -145000, `users`.`updated_at` = '2024-01-07 06:40:27' where `id` = 1
---
    public function purchase(Request $request)
    {
        $productsInSession = $request->session()->get("products");
        if ($productsInSession) {
            $userId = Auth::user()->getId();
            $order = new Order();
            $order->setUserId($userId);
            $order->setTotal(0);
            $order->save();

            $total = 0;
            $productsInCart = Product::findMany(array_keys($productsInSession));
            foreach ($productsInCart as $product) {
                $quantity = $productsInSession[$product->getId()];
                $item = new Item();
                $item->setQuantity($quantity);
                $item->setPrice($product->getPrice());
                $item->setProductId($product->getId());
                $item->setOrderId($order->getId());
                $item->save();
                $total = $total + ($product->getPrice() * $quantity);
            }
            $order->setTotal($total);
            $order->save();

            $newBalance = Auth::user()->getBalance() - $total;
            Auth::user()->setBalance($newBalance);
            Auth::user()->save();